** aggregate stats
#+begin_src ipython :results raw :session
  jdx = coastal[:]
  jdx[13] = False # Laghu - big errors in WRF
  w=np.asarray(wrf_rain).reshape((-1, 1))
  d = pd.DataFrame(np.r_[[h - y for h in [yh, yhc, yho, w]]].squeeze().T,
                   columns=['RANSAC', 'regular', 'orthogonal', 'WRF']).abs()
  d = pd.concat((d[coastal].mean(), d[jdx].mean()), 1)
  d.columns = ['no coastal', 'no coast, no LAGHU']
  hh.table(d)
#+end_src

#+RESULTS:
|            |    no coastal | no coast, no LAGHU |
|------------+---------------+--------------------|
| RANSAC     | 63.9783363144 |      63.9783363144 |
| regular    | 62.0063625776 |      62.0063625776 |
| orthogonal | 71.7178008979 |      71.7178008979 |
| WRF        | 57.4592655612 |      57.4592655612 |
